mgomov/libusb_stm32/src/usbd_stm32f723_otghs.c
/* This file is the part of the Lightweight USB device Stack for STM32 microcontrollers
 *
 * Copyright ©2016 Dmitry Filimonchuk <dmitrystu[at]gmail[dot]com>
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *   http://www.apache.org/licenses/LICENSE-2.0
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */

#include <stdint.h>
#include <stdbool.h>
#include "stm32.h"
#include "usb.h"

#if defined(USBD_STM32F723HS)

// ------------------------------------------
// BEGIN CUBE CODE
// ------------------------------------------

#if !defined  (HSE_VALUE) 
#define HSE_VALUE    ((uint32_t)25000000) /*!< Default value of the External oscillator in Hz */
#endif /* HSE_VALUE */

#if !defined  (HSI_VALUE)
#define HSI_VALUE    ((uint32_t)16000000) /*!< Value of the Internal oscillator in Hz*/
#endif /* HSI_VALUE */

/* This variable is updated in three ways:
   1) by calling CMSIS function SystemCoreClockUpdate()
   2) by calling HAL API function HAL_RCC_GetHCLKFreq()
   3) each time HAL_RCC_ClockConfig() is called to configure the system clock frequency 
   Note: If you use this function to configure the system clock; then there
   is no need to call the 2 first functions listed above, since SystemCoreClock
   variable is updated automatically.
*/
uint32_t SystemCoreClock = 16000000;

#define USBx_PCGCCTL    *(__IO uint32_t *)((uint32_t)USBx_BASE + USB_OTG_PCGCCTL_BASE)
#define USBx_DEVICE     ((USB_OTG_DeviceTypeDef *)(USBx_BASE + USB_OTG_DEVICE_BASE))
#define USB_OTG_SPEED_HIGH                     0U
#define USBx_INEP(i)    ((USB_OTG_INEndpointTypeDef *)(USBx_BASE + USB_OTG_IN_ENDPOINT_BASE + ((i) * USB_OTG_EP_REG_SIZE)))
#define USBx_OUTEP(i)   ((USB_OTG_OUTEndpointTypeDef *)(USBx_BASE + USB_OTG_OUT_ENDPOINT_BASE + ((i) * USB_OTG_EP_REG_SIZE)))

#ifndef STM32F723xx
#error not STM32F723xx
#endif

#ifndef HSE_25MHZ
#error not HSE_25MHZ
#endif

void __libc_init_array(void) { }

void SysTick_Handler(void) { }  // TODO disable TICKINT not strictly necessary

void HAL_Delay(volatile uint32_t Delay)
{
  while(Delay) {
    if (SysTick->CTRL & SysTick_CTRL_COUNTFLAG_Msk) {
      Delay--;
    }
  }
}

void HAL_PCD_MspInit(void)
{
  /* Enable HS PHY Clock */
  //    __HAL_RCC_OTGPHYC_CLK_ENABLE();
  _BST(RCC->APB2ENR, RCC_APB2ENR_OTGPHYCEN);

  /* Enable USB HS Clocks */
  //    __HAL_RCC_USB_OTG_HS_CLK_ENABLE();
  _BST(RCC->AHB1ENR, RCC_AHB1ENR_OTGHSEN);

  //    __HAL_RCC_USB_OTG_HS_ULPI_CLK_ENABLE();
  _BST(RCC->AHB1ENR, RCC_AHB1ENR_OTGHSULPIEN);

  /* Set USBHS Interrupt to the lowest priority */
  //    HAL_NVIC_SetPriority(OTG_HS_IRQn, 5, 0);
  uint32_t prioritygroup = NVIC_GetPriorityGrouping();
  NVIC_SetPriority(OTG_HS_IRQn, NVIC_EncodePriority(prioritygroup, 5, 0));

  /* Enable USBHS Interrupt */
  //    HAL_NVIC_EnableIRQ(OTG_HS_IRQn);
  NVIC_EnableIRQ(OTG_HS_IRQn);
}

static void USB_HS_PHYCInit(void)
{
  /* Enable LDO */
  USB_HS_PHYC->USB_HS_PHYC_LDO |= USB_HS_PHYC_LDO_ENABLE;

  /* wait for LDO Ready */
  while ((USB_HS_PHYC->USB_HS_PHYC_LDO & USB_HS_PHYC_LDO_STATUS) == 0U);

  /* Controls PHY frequency operation selection */
  /* HSE = 25MHz */
  USB_HS_PHYC->USB_HS_PHYC_PLL = (0x5U << 1);

  /* Control the tuning interface of the High Speed PHY */
#if !defined  (USB_HS_PHYC_TUNE_VALUE)
#define USB_HS_PHYC_TUNE_VALUE        0x00000F13U /*!< Value of USB HS PHY Tune */
#endif /* USB_HS_PHYC_TUNE_VALUE */
  USB_HS_PHYC->USB_HS_PHYC_TUNE |= USB_HS_PHYC_TUNE_VALUE;

  /* Enable PLL internal PHY */
  USB_HS_PHYC->USB_HS_PHYC_PLL |= USB_HS_PHYC_PLL_PLLEN;

  /* 2ms Delay required to get internal phy clock stable */
  HAL_Delay(2U);
}

static void USB_CoreReset(USB_OTG_GlobalTypeDef *USBx)
{
  /* Wait for AHB master IDLE state. */
  while ((USBx->GRSTCTL & USB_OTG_GRSTCTL_AHBIDL) == 0U);

  /* Core Soft Reset */
  USBx->GRSTCTL |= USB_OTG_GRSTCTL_CSRST;

  while ((USBx->GRSTCTL & USB_OTG_GRSTCTL_CSRST) == USB_OTG_GRSTCTL_CSRST);
}

void USB_CoreInit(USB_OTG_GlobalTypeDef *USBx)
{
  USBx->GCCFG &= ~(USB_OTG_GCCFG_PWRDWN);

  /* Init The UTMI Interface */
  USBx->GUSBCFG &= ~(USB_OTG_GUSBCFG_TSDPS | USB_OTG_GUSBCFG_ULPIFSLS | USB_OTG_GUSBCFG_PHYSEL);

  /* Select vbus source */
  USBx->GUSBCFG &= ~(USB_OTG_GUSBCFG_ULPIEVBUSD | USB_OTG_GUSBCFG_ULPIEVBUSI);

  /* Select UTMI Interace */
  USBx->GUSBCFG &= ~USB_OTG_GUSBCFG_ULPI_UTMI_SEL;
  USBx->GCCFG |= USB_OTG_GCCFG_PHYHSEN;

  /* Enables control of a High Speed USB PHY */
  USB_HS_PHYCInit();

  if (0) // TODO figure out external VBUS???
    {
      USBx->GUSBCFG |= USB_OTG_GUSBCFG_ULPIEVBUSD;
    }
  /* Reset after a PHY select  */
  USB_CoreReset(USBx);
}

void USB_SetCurrentMode(USB_OTG_GlobalTypeDef *USBx)
{
  USBx->GUSBCFG &= ~(USB_OTG_GUSBCFG_FHMOD | USB_OTG_GUSBCFG_FDMOD);
  // else if (mode == USB_DEVICE_MODE)
  USBx->GUSBCFG |= USB_OTG_GUSBCFG_FDMOD;
  HAL_Delay(50U);
}

void USB_FlushTxFifo(USB_OTG_GlobalTypeDef *USBx, uint32_t num)
{
  USBx->GRSTCTL = (USB_OTG_GRSTCTL_TXFFLSH | (num << 6));
  while ((USBx->GRSTCTL & USB_OTG_GRSTCTL_TXFFLSH) == USB_OTG_GRSTCTL_TXFFLSH);
}

void USB_FlushRxFifo(USB_OTG_GlobalTypeDef *USBx)
{
  USBx->GRSTCTL = USB_OTG_GRSTCTL_RXFFLSH;
  while ((USBx->GRSTCTL & USB_OTG_GRSTCTL_RXFFLSH) == USB_OTG_GRSTCTL_RXFFLSH);
}

void USB_DevInit(USB_OTG_GlobalTypeDef *USBx)
{
  const int dev_endpoints = 9;
  uint32_t USBx_BASE = (uint32_t)USBx;
  uint32_t i;
  for (i = 0U; i < 15U; i++)
    {
      USBx->DIEPTXF[i] = 0U;
    }

  /* VBUS Sensing setup */
  //  if (cfg.vbus_sensing_enable == 0U)
  //  {
  //    USBx_DEVICE->DCTL |= USB_OTG_DCTL_SDIS;
  //
  //    /* Deactivate VBUS Sensing B */
  //    USBx->GCCFG &= ~USB_OTG_GCCFG_VBDEN;
  //
  //    /* B-peripheral session valid override enable */
  //    USBx->GOTGCTL |= USB_OTG_GOTGCTL_BVALOEN;
  //    USBx->GOTGCTL |= USB_OTG_GOTGCTL_BVALOVAL;
  //  }
  //  else
  //  {
  /* Enable HW VBUS sensing */
  USBx->GCCFG |= USB_OTG_GCCFG_VBDEN;
  //  }

  /* Restart the Phy Clock */
  USBx_PCGCCTL = 0U;

