mgomov/libusb_stm32/src/usbd_stm32f723_otghs.c
  /* Device mode configuration */
  //      /* Set Core speed to High speed mode */
  //      (void)USB_SetDevSpeed(USBx, USB_OTG_SPEED_HIGH);
  USBx_DEVICE->DCFG |= USB_OTG_SPEED_HIGH;

  /* Flush the FIFOs */
  USB_FlushTxFifo(USBx, 0x10U); /* all Tx FIFOs */

  USB_FlushRxFifo(USBx);

  /* Clear all pending Device Interrupts */
  USBx_DEVICE->DIEPMSK = 0U;
  USBx_DEVICE->DOEPMSK = 0U;
  USBx_DEVICE->DAINTMSK = 0U;

  for (i = 0U; i < dev_endpoints; i++) {
    if ((USBx_INEP(i)->DIEPCTL & USB_OTG_DIEPCTL_EPENA) == USB_OTG_DIEPCTL_EPENA) {
      if (i == 0U) {
        USBx_INEP(i)->DIEPCTL = USB_OTG_DIEPCTL_SNAK;
      } else {
        USBx_INEP(i)->DIEPCTL = USB_OTG_DIEPCTL_EPDIS | USB_OTG_DIEPCTL_SNAK;
      }
    } else {
      USBx_INEP(i)->DIEPCTL = 0U;
    }
    USBx_INEP(i)->DIEPTSIZ = 0U;
    USBx_INEP(i)->DIEPINT  = 0xFB7FU;
  }

  for (i = 0U; i < dev_endpoints; i++) {
    if ((USBx_OUTEP(i)->DOEPCTL & USB_OTG_DOEPCTL_EPENA) == USB_OTG_DOEPCTL_EPENA) {
      if (i == 0U) {
        USBx_OUTEP(i)->DOEPCTL = USB_OTG_DOEPCTL_SNAK;
      } else {
        USBx_OUTEP(i)->DOEPCTL = USB_OTG_DOEPCTL_EPDIS | USB_OTG_DOEPCTL_SNAK;
      }
    } else {
      USBx_OUTEP(i)->DOEPCTL = 0U;
    }
    USBx_OUTEP(i)->DOEPTSIZ = 0U;
    USBx_OUTEP(i)->DOEPINT  = 0xFB7FU;
  }

  USBx_DEVICE->DIEPMSK &= ~(USB_OTG_DIEPMSK_TXFURM);

  /* Disable all interrupts. */
  USBx->GINTMSK = 0U;

  /* Clear any pending interrupts */
  USBx->GINTSTS = 0xBFFFFFFFU;

  /* Enable the common interrupts */
  //  if (cfg.dma_enable == 0U)
  //  {
  USBx->GINTMSK |= USB_OTG_GINTMSK_RXFLVLM;
  //  }

  /* Enable interrupts matching to the Device mode ONLY */
  USBx->GINTMSK |= USB_OTG_GINTMSK_USBSUSPM | USB_OTG_GINTMSK_USBRST |
    USB_OTG_GINTMSK_ENUMDNEM | USB_OTG_GINTMSK_IEPINT |
    USB_OTG_GINTMSK_OEPINT   | USB_OTG_GINTMSK_IISOIXFRM |
    USB_OTG_GINTMSK_PXFRM_IISOOXFRM | USB_OTG_GINTMSK_WUIM;

  //  if (cfg.Sof_enable != 0U)
  //  {
  //    USBx->GINTMSK |= USB_OTG_GINTMSK_SOFM;
  //  }

  //  if (cfg.vbus_sensing_enable == 1U)
  //  {
  USBx->GINTMSK |= (USB_OTG_GINTMSK_SRQIM | USB_OTG_GINTMSK_OTGINT);
  //  }
}

void USB_DevConnect(USB_OTG_GlobalTypeDef *USBx)
{
  uint32_t USBx_BASE = (uint32_t)USBx;
  USBx_DEVICE->DCTL &= ~USB_OTG_DCTL_SDIS;
  HAL_Delay(3U);
}

void USB_DevDisconnect(USB_OTG_GlobalTypeDef *USBx)
{
  uint32_t USBx_BASE = (uint32_t)USBx;
  USBx_DEVICE->DCTL |= USB_OTG_DCTL_SDIS;
  HAL_Delay(3U);
}

void init_usb(void)
{
  HAL_PCD_MspInit();
  USB_CoreInit(USB_OTG_HS);
  USB_SetCurrentMode(USB_OTG_HS);
  USB_DevInit(USB_OTG_HS);
  USB_DevDisconnect(USB_OTG_HS);

  //	HAL_PCDEx_SetRxFiFo(&hpcd, 0x200);
  //	HAL_PCDEx_SetTxFiFo(&hpcd, 0, 0x80);
  //	HAL_PCDEx_SetTxFiFo(&hpcd, 1, 0x174);
  USB_OTG_HS->GRXFSIZ = 0x200;
  uint32_t Tx_Offset = USB_OTG_HS->GRXFSIZ;
  USB_OTG_HS->DIEPTXF0_HNPTXFSIZ = ((uint32_t)0x80 << 16) | Tx_Offset;
  Tx_Offset += (USB_OTG_HS->DIEPTXF0_HNPTXFSIZ) >> 16;
  USB_OTG_HS->DIEPTXF[1 - 1U] = ((uint32_t)0x174 << 16) | Tx_Offset;

  USB_DevConnect(USB_OTG_HS);
  //	Enables the controller's Global Int in the AHB Config reg
  //	USB_OTG_HS->GAHBCFG |= USB_OTG_GAHBCFG_GINT;
}

// ------------------------------------------
// END CUBE CODE
// ------------------------------------------

#define MAX_EP          9 // per cubef7
#define MAX_RX_PACKET   128 // usbhs constant
#define MAX_CONTROL_EP  1
#define MAX_FIFO_SZ     1024  /*in 32-bit chunks */ // should be correct per 1228

#define RX_FIFO_SZ      (10 + (2 * (MAX_RX_PACKET / 4) + 1)) // TODO what's the math behind this?

#define STATUS_VAL(x)   (USBD_HW_ADDRFST | (x))

#define BWAIT for(volatile long i; 1;){ i++; }

static USB_OTG_GlobalTypeDef * const OTG  = (void*)(USB_OTG_HS_PERIPH_BASE + USB_OTG_GLOBAL_BASE);
static USB_OTG_DeviceTypeDef * const OTGD = (void*)(USB_OTG_HS_PERIPH_BASE + USB_OTG_DEVICE_BASE);
static volatile uint32_t * const OTGPCTL  = (void*)(USB_OTG_HS_PERIPH_BASE + USB_OTG_PCGCCTL_BASE);


inline static uint32_t* EPFIFO(uint32_t ep) {
  return (uint32_t*)(USB_OTG_HS_PERIPH_BASE + USB_OTG_FIFO_BASE + (ep << 12));
}

inline static USB_OTG_INEndpointTypeDef* EPIN(uint32_t ep) {
  return (void*)(USB_OTG_HS_PERIPH_BASE + USB_OTG_IN_ENDPOINT_BASE + (ep << 5));
}

inline static USB_OTG_OUTEndpointTypeDef* EPOUT(uint32_t ep) {
  return (void*)(USB_OTG_HS_PERIPH_BASE + USB_OTG_OUT_ENDPOINT_BASE + (ep << 5));
}

inline static void Flush_RX(void) {
  _BST(OTG->GRSTCTL, USB_OTG_GRSTCTL_RXFFLSH);
  _WBC(OTG->GRSTCTL, USB_OTG_GRSTCTL_RXFFLSH);
}

inline static void Flush_TX(uint8_t ep) {
  _BMD(OTG->GRSTCTL, USB_OTG_GRSTCTL_TXFNUM,
       _VAL2FLD(USB_OTG_GRSTCTL_TXFNUM, ep) | USB_OTG_GRSTCTL_TXFFLSH);
  _WBC(OTG->GRSTCTL, USB_OTG_GRSTCTL_TXFFLSH);
}

static uint32_t getinfo(void) {
  if (!(RCC->AHB1ENR & RCC_AHB1ENR_OTGHSEN)) return STATUS_VAL(0);
  if (!(OTGD->DCTL & USB_OTG_DCTL_SDIS)) {
    if (_FLD2VAL(USB_OTG_DSTS_ENUMSPD, OTGD->DSTS) == 0x00) return STATUS_VAL(USBD_HW_ENABLED | USBD_HW_SPEED_HS);
    if (_FLD2VAL(USB_OTG_DSTS_ENUMSPD, OTGD->DSTS) == 0x03) return STATUS_VAL(USBD_HW_ENABLED | USBD_HW_SPEED_FS);
  }
  return STATUS_VAL(USBD_HW_ENABLED | USBD_HW_SPEED_NC);
}

// should be OK; TODO endpoint addressing correct???
static void ep_setstall(uint8_t ep, bool stall) {
  if (ep & 0x80) {
    ep &= 0x7F;
    uint32_t _t = EPIN(ep)->DIEPCTL;
    if (_t & USB_OTG_DIEPCTL_USBAEP) {
      if (stall) {
        _BST(_t, USB_OTG_DIEPCTL_STALL);
      } else {
        _BMD(_t, USB_OTG_DIEPCTL_STALL,
             USB_OTG_DIEPCTL_SD0PID_SEVNFRM | USB_OTG_DOEPCTL_SNAK);
      }
      EPIN(ep)->DIEPCTL = _t;
    }
  } else {
    uint32_t _t = EPOUT(ep)->DOEPCTL;
    if (_t & USB_OTG_DOEPCTL_USBAEP) {
      if (stall) {
        _BST(_t, USB_OTG_DOEPCTL_STALL);
      } else {
        _BMD(_t, USB_OTG_DOEPCTL_STALL,
             USB_OTG_DOEPCTL_SD0PID_SEVNFRM | USB_OTG_DOEPCTL_CNAK);
      }
      EPOUT(ep)->DOEPCTL = _t;
    }
  }
}

// OK
static bool ep_isstalled(uint8_t ep) {
  if (ep & 0x80) {
    ep &= 0x7F;
    return (EPIN(ep)->DIEPCTL & USB_OTG_DIEPCTL_STALL) ? true : false;
  } else {
    return (EPOUT(ep)->DOEPCTL & USB_OTG_DOEPCTL_STALL) ? true : false;
  }
}

